[
  {"id":1,"word":"Algorithm","category":"Tech","short":"A finite sequence of well-defined instructions for solving a problem or performing a computation.","full":"An algorithm is a step-by-step procedure or formula for solving a problem, based on conducting a sequence of specified actions. In computer science, algorithms are the backbone of all software — from sorting a list of names to training a neural network. The term originates from the name of the 9th-century Persian mathematician Muhammad ibn Musa al-Khwarizmi. Algorithms are evaluated by their time complexity (how fast they run) and space complexity (how much memory they use). Famous examples include Dijkstra's shortest path algorithm, the QuickSort sorting algorithm, and the PageRank algorithm that powers Google Search.","letter":"A","tags":["computer science","mathematics","logic"]},
  {"id":2,"word":"Axiom","category":"Science","short":"A statement regarded as self-evidently true and accepted without proof as a basis for further reasoning.","full":"In mathematics and logic, an axiom is a fundamental premise accepted as true without requiring proof. Axioms form the foundation of any logical or mathematical system. Euclid's five postulates form the basis of classical geometry. In modern mathematics, axiomatic set theory (Zermelo–Fraenkel) provides the foundation for virtually all of mathematics. Theorems are proven from axioms, while axioms themselves require no proof within the system they define.","letter":"A","tags":["mathematics","logic","philosophy"]},
  {"id":3,"word":"Baroque","category":"History","short":"A highly ornate style of architecture, art, and music flourishing in Europe from the early 17th to mid-18th century.","full":"The Baroque period (roughly 1600–1750) was one of the most dramatic and expressive eras in Western cultural history. Key figures include Bach, Handel, Rubens, Rembrandt, and Bernini. The aesthetic was deliberately designed to evoke awe — a response to the austere simplicity of Protestant worship. The term may derive from the Portuguese 'barroco,' meaning an irregularly shaped pearl.","letter":"B","tags":["art","architecture","music","europe"]},
  {"id":4,"word":"Bandwidth","category":"Tech","short":"The maximum rate of data transfer across a given path in a network, measured in bits per second.","full":"In telecommunications, bandwidth refers to the capacity of a communication channel — how much data can be transmitted in a given amount of time. Measured in bps, Kbps, Mbps, or Gbps. Bandwidth is often confused with 'speed,' but more precisely it is a measure of capacity rather than velocity. Fiber optic connections — capable of terabits per second — enable richer, faster internet experiences than older copper telephone lines.","letter":"B","tags":["networking","internet","telecommunications"]},
  {"id":5,"word":"Cognition","category":"Science","short":"The mental action or process of acquiring knowledge and understanding through thought, experience, and the senses.","full":"Cognition encompasses all mental processes involved in gaining knowledge — including perception, attention, memory, language, problem-solving, creativity, and reasoning. Cognitive science draws from psychology, neuroscience, linguistics, philosophy, and artificial intelligence. Piaget's developmental theory described how cognition evolves through childhood. Modern cognitive neuroscience uses brain imaging to map these processes to neural structures.","letter":"C","tags":["psychology","neuroscience","philosophy of mind"]},
  {"id":6,"word":"Cryptography","category":"Tech","short":"The practice and study of techniques for secure communication in the presence of adversarial behavior.","full":"Cryptography is the science of encoding and decoding information so that only intended recipients can access it. Modern cryptography relies on computationally hard mathematical problems: RSA encryption depends on the difficulty of factoring large prime numbers. Symmetric-key cryptography uses the same key to encrypt and decrypt; asymmetric (public-key) cryptography uses a pair of mathematically linked keys. Cryptography underpins SSL/TLS, cryptocurrency, digital signatures, and secure messaging.","letter":"C","tags":["security","mathematics","computer science"]},
  {"id":7,"word":"Dialectic","category":"Language","short":"A method of argument for resolving disagreement through rational discussion, involving the contradiction of opposing ideas.","full":"Dialectic is a form of logical argumentation that juxtaposes opposing ideas to arrive at a synthesis or deeper truth. The Socratic method — questioning assumptions to expose contradictions — is its earliest famous form. Hegel formalized the concept into thesis–antithesis–synthesis. Marx adapted Hegelian dialectic into 'dialectical materialism,' applying it to historical and economic forces.","letter":"D","tags":["philosophy","logic","rhetoric"]},
  {"id":8,"word":"Dopamine","category":"Science","short":"A neurotransmitter that plays a major role in reward-motivated behavior, motor control, and regulation of mood.","full":"Dopamine is a catecholamine neurotransmitter produced in several areas of the brain, including the substantia nigra and ventral tegmental area. It is known for its role in the brain's reward system. Dopamine also regulates motor control (its depletion causes Parkinson's disease), working memory, attention, and executive function. Many drugs of abuse work by flooding the brain with dopamine or preventing its reuptake.","letter":"D","tags":["neuroscience","biology","psychology"]},
  {"id":9,"word":"Empiricism","category":"Science","short":"The theory that all knowledge is derived from sensory experience, emphasizing evidence and observation over innate ideas.","full":"Empiricism is a philosophical stance holding that knowledge comes primarily from sensory experience and observation. It stands in contrast to rationalism. Key empiricists include John Locke (who argued the mind begins as a blank slate — tabula rasa), George Berkeley, and David Hume. The scientific method is fundamentally empirical: hypotheses must be tested against observable evidence.","letter":"E","tags":["philosophy","epistemology","science"]},
  {"id":10,"word":"Entropy","category":"Science","short":"A measure of disorder or randomness in a system; the unavailability of energy for work in thermodynamics.","full":"Entropy is one of the most profound concepts in science. In thermodynamics, it quantifies the degree of disorder in a system. The Second Law of Thermodynamics states that in an isolated system, entropy never decreases. In information theory, Claude Shannon defined entropy as a measure of uncertainty or information content. The ultimate fate of the universe may be 'heat death' — maximum entropy where no work can be extracted.","letter":"E","tags":["physics","thermodynamics","information theory"]},
  {"id":11,"word":"Etymology","category":"Language","short":"The study of the origin and historical development of words and their meanings.","full":"Etymology traces the history of words — their origins, how they entered a language, and how their forms and meanings changed over time. English draws from Old English, Old Norse, Norman French, Latin, and Greek. The word 'etymology' itself comes from Greek 'etymon' (true sense) and 'logia' (study). The Oxford English Dictionary documents the first known usage of words and traces their evolution through centuries of written records.","letter":"E","tags":["linguistics","history","philology"]},
  {"id":12,"word":"Fibonacci","category":"Science","short":"A sequence where each number is the sum of the two preceding ones: 0, 1, 1, 2, 3, 5, 8, 13, 21…","full":"The Fibonacci sequence was described by Leonardo of Pisa (nicknamed Fibonacci) in his 1202 book Liber Abaci, though it was known in Indian mathematics earlier. Its ratio between consecutive terms converges to the golden ratio (φ ≈ 1.618), which appears in nature: the spiraling of sunflower seeds, the arrangement of leaves on a stem, the spirals of a nautilus shell. Fibonacci numbers also appear in computer science algorithms and data structures.","letter":"F","tags":["mathematics","nature","patterns"]},
  {"id":13,"word":"Gestalt","category":"Language","short":"A concept in psychology describing how the mind perceives the whole as greater than the sum of its parts.","full":"Gestalt (German for 'shape' or 'form') refers to a school of thought in psychology founded in early 20th century Berlin by Wertheimer, Koffka, and Köhler. The gestalt principles of perception include: proximity, similarity, closure, continuity, and figure-ground. The insight that 'the whole is other than the sum of its parts' has influenced cognitive psychology, design, and UX theory.","letter":"G","tags":["psychology","perception","design"]},
  {"id":14,"word":"Heuristic","category":"Tech","short":"A practical problem-solving approach using a rule of thumb to find a satisfactory — though not necessarily optimal — solution.","full":"A heuristic (from Greek 'heuriskein,' to discover) is a mental shortcut enabling quick decision-making in complex situations. Unlike algorithms, heuristics do not guarantee an optimal solution, but they are faster and use less cognitive effort. In cognitive psychology, Kahneman and Tversky identified availability, representativeness, and anchoring heuristics. In computer science, heuristic algorithms sacrifice guaranteed optimality for practical speed.","letter":"H","tags":["psychology","computer science","decision making"]},
  {"id":15,"word":"Hegemony","category":"History","short":"Leadership or dominance by one country or social group over others, achieved through cultural or ideological influence.","full":"Hegemony derives from the Greek 'hegemonia,' meaning leadership or rule. In modern political theory, the term was transformed by Italian Marxist philosopher Antonio Gramsci, who distinguished between domination (coercive rule) and hegemony (consensual leadership achieved through cultural and ideological influence). Gramscian hegemony describes how dominant classes maintain power by shaping the cultural beliefs, values, and norms of society.","letter":"H","tags":["politics","sociology","history"]},
  {"id":16,"word":"Inference","category":"Tech","short":"The process of deriving logical conclusions from premises; in AI, running a trained model to produce outputs.","full":"Inference has two major meanings. In logic, it is the process of deriving a conclusion from premises — either deductively or inductively. In machine learning, inference refers to using a trained neural network to make predictions on new data, as opposed to the training phase. Inference speed and efficiency are critical in production AI systems — model quantization, pruning, and specialized hardware are used to accelerate inference.","letter":"I","tags":["logic","AI","statistics"]},
  {"id":17,"word":"Juxtaposition","category":"Language","short":"The act of placing two things side by side for contrasting effect, highlighting differences or creating meaning.","full":"Juxtaposition is a literary, rhetorical, and artistic device in which two elements are placed in close proximity to highlight their contrast or relationship. In literature it creates tension, irony, or deeper meaning. In visual art and film, contrasting images placed side by side provoke comparison and emotional response. Juxtaposition is fundamental to montage theory in cinema, famously articulated by Sergei Eisenstein.","letter":"J","tags":["literature","rhetoric","art"]},
  {"id":18,"word":"Kernel","category":"Tech","short":"The core of an operating system that manages hardware resources and provides services to higher-level software.","full":"In computing, the kernel is the central component of an operating system — sitting between hardware and software, managing system resources. Key responsibilities include process scheduling, memory management, device driver management, and system calls. Major architectures include monolithic kernels (like Linux), microkernels, and hybrid kernels (macOS, Windows). The Linux kernel, created by Linus Torvalds in 1991, now powers the majority of servers, Android devices, and supercomputers.","letter":"K","tags":["operating systems","computer science","Linux"]},
  {"id":19,"word":"Latency","category":"Tech","short":"The time delay between a cause and its effect; in computing, the delay between a request and its response.","full":"Latency is the time it takes for data to travel from source to destination. In networking, measured in milliseconds, it is distinct from bandwidth. Sources include propagation delay, transmission delay, processing delay, and queuing delay. For interactive applications like gaming, video calls, and financial trading, low latency is paramount. The geographic constraint of the speed of light means that latency can never be eliminated — it is a fundamental physical limit.","letter":"L","tags":["networking","performance","computing"]},
  {"id":20,"word":"Linguistics","category":"Language","short":"The scientific study of language and its structure, including phonology, morphology, syntax, semantics, and pragmatics.","full":"Linguistics is the systematic, scientific study of language — its structure, use, history, and relationship to the mind and society. Subfields include phonology (sound), morphology (word structure), syntax (sentence structure), semantics (meaning), and pragmatics (context). Saussure's distinction between 'langue' and 'parole' shaped modern linguistic theory. Chomsky's generative grammar proposed that humans have an innate language acquisition device.","letter":"L","tags":["language","cognition","social science"]},
  {"id":21,"word":"Manifold","category":"Science","short":"In mathematics, a topological space that locally resembles Euclidean space; in ML, the structure underlying high-dimensional data.","full":"A manifold is a mathematical object that locally resembles flat (Euclidean) space, even if its global structure is curved. A familiar example is Earth's surface: locally flat, but globally a sphere — a two-dimensional manifold. In machine learning, the 'manifold hypothesis' proposes that high-dimensional data lies on or near a low-dimensional manifold. This motivates dimensionality reduction techniques like PCA, t-SNE, and UMAP.","letter":"M","tags":["mathematics","topology","machine learning"]},
  {"id":22,"word":"Metamorphosis","category":"Science","short":"A biological process of transformation in which an organism undergoes a marked change in form, structure, or habit.","full":"Metamorphosis is the dramatic biological transformation certain animals undergo during development. In insects, complete metamorphosis (holometabolism) involves: egg, larva, pupa, and adult — as seen in butterflies and beetles. Incomplete metamorphosis (hemimetabolism), seen in grasshoppers, involves egg, nymph, and adult. Amphibian metamorphosis, as in frogs, involves dramatic anatomical reorganization. Ovid's Metamorphoses famously uses transformation as a literary metaphor.","letter":"M","tags":["biology","zoology","development"]},
  {"id":23,"word":"Nihilism","category":"History","short":"The rejection of all religious and moral principles; the belief that life is without objective meaning, purpose, or intrinsic value.","full":"Nihilism (from Latin 'nihil,' nothing) holds that life has no inherent meaning, value, or purpose. Nietzsche, who declared 'God is dead,' diagnosed nihilism as the crisis of modernity. He distinguished passive nihilism (despair) from active nihilism (creative destruction of old values). Existentialists like Sartre and Camus grappled with nihilism by arguing that humans must create their own meaning in an indifferent universe.","letter":"N","tags":["philosophy","existentialism","ethics"]},
  {"id":24,"word":"Ontology","category":"Science","short":"The branch of philosophy concerned with the nature of being, existence, and the categories of reality.","full":"Ontology is the branch of metaphysics investigating the fundamental nature of reality. Core questions include: Does the external world exist independently of our perception? What is the relationship between mind and matter? Major positions include materialism, idealism, dualism, and neutral monism. In computer science and AI, an ontology is a formal representation of knowledge within a domain — a structured vocabulary of concepts used in semantic web technologies.","letter":"O","tags":["philosophy","metaphysics","AI"]},
  {"id":25,"word":"Paradigm","category":"Science","short":"A typical example or pattern; in science, a framework of assumptions and practices defining a scientific discipline.","full":"Thomas Kuhn's 1962 book The Structure of Scientific Revolutions introduced the paradigm into philosophy of science. A scientific paradigm is the set of assumptions and methods that define 'normal science.' Science progresses through 'paradigm shifts' — revolutionary episodes where one framework is overthrown. Examples: the Copernican revolution, Darwinian evolution, and quantum mechanics. 'Paradigm shift' now broadly denotes any fundamental change in approach.","letter":"P","tags":["philosophy of science","history of science","epistemology"]},
  {"id":26,"word":"Recursion","category":"Tech","short":"A method of solving problems where the solution depends on solutions to smaller instances of the same problem.","full":"Recursion is a fundamental concept where a function calls itself to solve progressively simpler instances of a problem until a 'base case' is reached. Classic examples include computing factorials, traversing tree structures, and the Fibonacci sequence. Recursion elegantly mirrors many real-world structures: file systems, HTML DOMs, and mathematical fractals. Deep recursion risks stack overflow. Douglas Hofstadter's Gödel, Escher, Bach is celebrated for its exploration of recursion and self-reference.","letter":"R","tags":["computer science","mathematics","algorithms"]},
  {"id":27,"word":"Rhetoric","category":"Language","short":"The art of effective or persuasive speaking or writing, using figures of speech and other composition techniques.","full":"Rhetoric — the art of persuasion through language — has been studied since ancient Greece. Aristotle's Rhetoric identified three modes of persuasion: ethos (credibility), pathos (emotional appeal), and logos (logical argument). In the medieval university, rhetoric was one of the three foundational disciplines of the trivium. While 'rhetorical' often carries a pejorative connotation, the discipline examines how language shapes understanding, identity, and social reality.","letter":"R","tags":["language","communication","philosophy"]},
  {"id":28,"word":"Semiotics","category":"Language","short":"The study of signs, symbols, and their use or interpretation in communication and meaning-making.","full":"Semiotics is the study of signs and processes by which meaning is made. Saussure distinguished the 'signifier' (form of a sign) from the 'signified' (the concept), arguing their relationship is arbitrary. Peirce classified signs into icons, indices, and symbols. Roland Barthes extended semiotics into cultural analysis, examining how images, fashion, and media communicate ideological meanings beneath their surface.","letter":"S","tags":["linguistics","philosophy","cultural theory"]},
  {"id":29,"word":"Synthesis","category":"Science","short":"The combination of elements to form a connected whole; in chemistry, the production of a substance through chemical processes.","full":"Synthesis carries distinct meanings across disciplines. In philosophy, synthesis is the resolution of thesis and antithesis into a higher-order concept. In chemistry, synthesis is constructing complex molecules from simpler precursors — central to organic chemistry and pharmaceuticals. Total synthesis — constructing a complex natural molecule from simple starting materials — is one of chemistry's great challenges. In general usage, synthesis denotes combining diverse knowledge into a coherent whole — the highest order of thinking in Bloom's taxonomy.","letter":"S","tags":["chemistry","philosophy","cognition"]},
  {"id":30,"word":"Turing Test","category":"Tech","short":"A test proposed by Alan Turing to evaluate whether a machine can exhibit intelligent behavior indistinguishable from a human.","full":"Proposed by Alan Turing in his 1950 paper 'Computing Machinery and Intelligence,' the Turing Test asks whether a machine can exhibit conversational behavior indistinguishable from a human. In the 'imitation game,' a judge converses with both a human and a machine — if the judge cannot reliably distinguish them, the machine has passed. Critics, including Searle's Chinese Room argument, contend passing demonstrates only behavioral simulation, not genuine understanding.","letter":"T","tags":["AI","computer science","philosophy of mind"]},
  {"id":31,"word":"Vernacular","category":"Language","short":"The language or dialect spoken by ordinary people in a particular region; informal, everyday speech.","full":"Vernacular refers to the native or indigenous language of a region, especially as opposed to a literary or foreign language. In medieval Europe, Latin was the language of scholarship and religion, while the vernacular was the spoken language of ordinary people. Dante's decision to write the Divine Comedy in Italian vernacular was a landmark moment in literary history. In linguistics, vernacular is contrasted with the 'prestige dialect' associated with formal and institutional use.","letter":"V","tags":["linguistics","history","architecture"]},
  {"id":32,"word":"Xenophobia","category":"History","short":"Dislike or prejudice against people from other countries, cultures, or those perceived as strangers or outsiders.","full":"Xenophobia (from Greek 'xenos,' stranger, and 'phobos,' fear) refers to irrational fear or hostility toward people perceived as foreign or different. Unlike racism (based on perceived racial characteristics), xenophobia is specifically directed at those perceived as outsiders. Sociologists study xenophobia as both individual attitude and structural phenomenon embedded in policy and institutions.","letter":"X","tags":["sociology","psychology","politics"]},
  {"id":33,"word":"Zeitgeist","category":"History","short":"The defining spirit or mood of a particular period of history as shown by the ideas and beliefs of the time.","full":"Zeitgeist is a German loanword (Zeit = time, Geist = spirit) that entered English in the 19th century through Hegel and German Romantic philosophy. It refers to the intellectual, cultural, and spiritual climate of an era. Hegel saw the Zeitgeist as a metaphysical force driving the progressive unfolding of history. Understanding the zeitgeist is a central goal of cultural historians, sociologists, and critics.","letter":"Z","tags":["philosophy","history","culture"]}
]
